cylinderTests/cylinderFlow2D_rK/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rk4Foam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         500;

deltaT          0.05;

writeControl    runTime;

writeInterval   0.5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  16;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;



functions
{
    #includeFunc  forceCoeffsIncompressible
}

// ************************************************************************* //
